{
  "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceConfigurations/$entity",
  "allowAllAppsAccess": null,
  "subjectAlternativeNameFormatString": null,
  "@odata.type": "#microsoft.graph.macOSScepCertificateProfile",
  "extendedKeyUsages": [
    {
      "objectIdentifier": "1.3.6.1.5.5.7.3.2",
      "name": "Client Authentication"
    }
  ],
  "hashAlgorithm": null,
  "certificateValidityPeriodValue": 1,
  "subjectNameFormatString": "CN=MacX-{{AAD_Device_ID}}",
  "renewalThresholdPercentage": 20,
  "keySize": "size4096",
  "deviceManagementApplicabilityRuleDeviceMode": null,
  "deviceManagementApplicabilityRuleOsVersion": null,
  "description": null,
  "supportsScopeTags": true,
  "subjectNameFormat": "custom",
  "deploymentChannel": "deviceChannel",
  "deviceManagementApplicabilityRuleOsEdition": null,
  "certificateValidityPeriodScale": "years",
  "id": "37f8454d-27bc-461e-b52b-842e463fa68d",
  "scepServerUrls": [
    "https://{{CloudPKIFQDN}}/TrafficGateway/PassThroughRoutingService/CloudPki/CloudPkiService/Scep/75844149-54c1-4b70-847c-b9607e90b1b5/1f9199cc-2432-4a9e-885a-b94fa2b73530"
  ],
  "version": 2,
  "keyUsage": "keyEncipherment,digitalSignature",
  "lastModifiedDateTime": "2025-01-20T15:39:58.7594025Z",
  "createdDateTime": "2024-10-02T13:10:46.7837193Z",
  "displayName": "macOS - CloudPKI Device Cert - Test",
  "customSubjectAlternativeNames": [
    {
      "sanType": "universalResourceIdentifier",
      "name": "IntuneDeviceId://{{DeviceId}}"
    }
  ],
  "roleScopeTagIds": [
    "0"
  ],
  "subjectAlternativeNameType": null,
  "certificateStore": "machine"
}
