{
  "name": "macOS - Antivirus",
  "description": "",
  "settings": [
    {
      "id": "0",
      "settingInstance": {
        "settingDefinitionId": "com.apple.managedclient.preferences_exclusionsmergepolicy",
        "auditRuleInformation": null,
        "choiceSettingValue": {
          "settingValueTemplateReference": {
            "settingValueTemplateId": "effc409a-9169-43f0-a807-2a388875cf99",
            "useTemplateDefault": false
          },
          "children": [],
          "value": "com.apple.managedclient.preferences_exclusionsmergepolicy_1"
        },
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "c07a6983-ac3e-4f38-be45-20954638dabd"
        }
      }
    },
    {
      "id": "1",
      "settingInstance": {
        "settingDefinitionId": "com.apple.managedclient.preferences_threattypesettings",
        "auditRuleInformation": null,
        "groupSettingCollectionValue": [
          {
            "settingValueTemplateReference": null,
            "children": [
              {
                "settingDefinitionId": "com.apple.managedclient.preferences_threattypesettings_item_value",
                "auditRuleInformation": null,
                "choiceSettingValue": {
                  "settingValueTemplateReference": {
                    "settingValueTemplateId": "2d7b917e-affe-47d4-aa42-8468bc109dad",
                    "useTemplateDefault": false
                  },
                  "children": [],
                  "value": "com.apple.managedclient.preferences_threattypesettings_item_value_1"
                },
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingInstanceTemplateReference": {
                  "settingInstanceTemplateId": "347d727a-70f7-4d22-af3d-5571052ce9d5"
                }
              },
              {
                "settingDefinitionId": "com.apple.managedclient.preferences_threattypesettings_item_key",
                "auditRuleInformation": null,
                "choiceSettingValue": {
                  "settingValueTemplateReference": {
                    "settingValueTemplateId": "45c09bfc-8cbd-4118-9396-17427d8c5795",
                    "useTemplateDefault": false
                  },
                  "children": [],
                  "value": "com.apple.managedclient.preferences_threattypesettings_item_key_0"
                },
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingInstanceTemplateReference": {
                  "settingInstanceTemplateId": "675e2ada-1e8f-46eb-9348-ab0707c86ed0"
                }
              }
            ]
          },
          {
            "settingValueTemplateReference": null,
            "children": [
              {
                "settingDefinitionId": "com.apple.managedclient.preferences_threattypesettings_item_value",
                "auditRuleInformation": null,
                "choiceSettingValue": {
                  "settingValueTemplateReference": {
                    "settingValueTemplateId": "61cb5321-0e1c-47dc-b117-1fd48e847332",
                    "useTemplateDefault": false
                  },
                  "children": [],
                  "value": "com.apple.managedclient.preferences_threattypesettings_item_value_1"
                },
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingInstanceTemplateReference": {
                  "settingInstanceTemplateId": "eea71161-a378-422c-b477-29f2b13f64ed"
                }
              },
              {
                "settingDefinitionId": "com.apple.managedclient.preferences_threattypesettings_item_key",
                "auditRuleInformation": null,
                "choiceSettingValue": {
                  "settingValueTemplateReference": {
                    "settingValueTemplateId": "8805bc0f-d152-4491-89a2-0c1789812471",
                    "useTemplateDefault": false
                  },
                  "children": [],
                  "value": "com.apple.managedclient.preferences_threattypesettings_item_key_1"
                },
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingInstanceTemplateReference": {
                  "settingInstanceTemplateId": "2865141e-6361-4611-8e39-6b2023bd38ae"
                }
              }
            ]
          }
        ],
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "f2df12de-2704-4a13-9e10-21f4857122aa"
        }
      }
    },
    {
      "id": "2",
      "settingInstance": {
        "settingDefinitionId": "com.apple.managedclient.preferences_threattypesettingsmergepolicy",
        "auditRuleInformation": null,
        "choiceSettingValue": {
          "settingValueTemplateReference": {
            "settingValueTemplateId": "613bcf39-69ec-4a1f-8822-07789ae7f8cb",
            "useTemplateDefault": false
          },
          "children": [],
          "value": "com.apple.managedclient.preferences_threattypesettingsmergepolicy_1"
        },
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "65d9ddaf-0552-4e40-8575-71dd54b2ccb4"
        }
      }
    },
    {
      "id": "3",
      "settingInstance": {
        "settingDefinitionId": "com.apple.managedclient.preferences_maximumondemandscanthreads",
        "auditRuleInformation": null,
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
        "simpleSettingValue": {
          "settingValueTemplateReference": {
            "settingValueTemplateId": "fe25bbb2-f6de-480a-9153-11f90d7dab4e",
            "useTemplateDefault": false
          },
          "value": 2,
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue"
        },
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "e02fd3ba-4146-4b7d-9c7f-dffec96465e5"
        }
      }
    },
    {
      "id": "4",
      "settingInstance": {
        "settingDefinitionId": "com.apple.managedclient.preferences_enablefilehashcomputation",
        "auditRuleInformation": null,
        "choiceSettingValue": {
          "settingValueTemplateReference": {
            "settingValueTemplateId": "96559430-ea19-4fb6-b98a-c237a2e31ae5",
            "useTemplateDefault": false
          },
          "children": [],
          "value": "com.apple.managedclient.preferences_enablefilehashcomputation_true"
        },
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "8472c23f-3f2d-4acf-9386-a0715ad6e591"
        }
      }
    },
    {
      "id": "5",
      "settingInstance": {
        "settingDefinitionId": "com.apple.managedclient.preferences_scanafterdefinitionupdate",
        "auditRuleInformation": null,
        "choiceSettingValue": {
          "settingValueTemplateReference": {
            "settingValueTemplateId": "1d05f27d-cc04-44a3-82f8-91df943b03e4",
            "useTemplateDefault": false
          },
          "children": [],
          "value": "com.apple.managedclient.preferences_scanafterdefinitionupdate_true"
        },
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "65bc7d9e-a0fc-4e3f-b464-550c30589e3c"
        }
      }
    },
    {
      "id": "6",
      "settingInstance": {
        "settingDefinitionId": "com.apple.managedclient.preferences_scanarchives",
        "auditRuleInformation": null,
        "choiceSettingValue": {
          "settingValueTemplateReference": {
            "settingValueTemplateId": "26bb4b38-6e8a-4e3d-9045-81314475b3fe",
            "useTemplateDefault": false
          },
          "children": [],
          "value": "com.apple.managedclient.preferences_scanarchives_true"
        },
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "27ca9434-85a0-4175-999d-bbef8eb8d066"
        }
      }
    },
    {
      "id": "7",
      "settingInstance": {
        "settingDefinitionId": "com.apple.managedclient.preferences_enforcementlevel_antivirusengine",
        "auditRuleInformation": null,
        "choiceSettingValue": {
          "settingValueTemplateReference": {
            "settingValueTemplateId": "440003a2-8406-47bb-a785-a45869556ead",
            "useTemplateDefault": false
          },
          "children": [],
          "value": "com.apple.managedclient.preferences_enforcementlevel_antivirusengine_2"
        },
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "a1bf7f4c-196e-4930-8395-a9b496433322"
        }
      }
    },
    {
      "id": "8",
      "settingInstance": {
        "settingDefinitionId": "com.apple.managedclient.preferences_enabled",
        "auditRuleInformation": null,
        "choiceSettingValue": {
          "settingValueTemplateReference": {
            "settingValueTemplateId": "7ea0a2aa-0953-4340-b590-522f040b0da3",
            "useTemplateDefault": false
          },
          "children": [],
          "value": "com.apple.managedclient.preferences_enabled_true"
        },
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "9e424cc6-35b9-48ef-863c-73295aa9d2d7"
        }
      }
    },
    {
      "id": "9",
      "settingInstance": {
        "settingDefinitionId": "com.apple.managedclient.preferences_automaticsamplesubmission",
        "auditRuleInformation": null,
        "choiceSettingValue": {
          "settingValueTemplateReference": {
            "settingValueTemplateId": "de57abd5-1a87-463e-96e7-e117524003ba",
            "useTemplateDefault": false
          },
          "children": [],
          "value": "com.apple.managedclient.preferences_automaticsamplesubmission_true"
        },
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "d5563bad-08c5-47de-8bbb-5d44e0f9a23a"
        }
      }
    },
    {
      "id": "10",
      "settingInstance": {
        "settingDefinitionId": "com.apple.managedclient.preferences_diagnosticlevel",
        "auditRuleInformation": null,
        "choiceSettingValue": {
          "settingValueTemplateReference": {
            "settingValueTemplateId": "5fc10db6-9ee5-434a-9ed0-1382bf72969e",
            "useTemplateDefault": false
          },
          "children": [],
          "value": "com.apple.managedclient.preferences_diagnosticlevel_1"
        },
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "c7a9a79b-20cf-461f-8021-94702a32543b"
        }
      }
    },
    {
      "id": "11",
      "settingInstance": {
        "settingDefinitionId": "com.apple.managedclient.preferences_automaticdefinitionupdateenabled",
        "auditRuleInformation": null,
        "choiceSettingValue": {
          "settingValueTemplateReference": {
            "settingValueTemplateId": "112fd4a8-1393-49b6-9569-0d37266a6ad3",
            "useTemplateDefault": false
          },
          "children": [],
          "value": "com.apple.managedclient.preferences_automaticdefinitionupdateenabled_true"
        },
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "cc18c6dc-dca5-4845-9c78-c718c9447ddd"
        }
      }
    },
    {
      "id": "12",
      "settingInstance": {
        "settingDefinitionId": "com.apple.managedclient.preferences_enforcementlevel",
        "auditRuleInformation": null,
        "choiceSettingValue": {
          "settingValueTemplateReference": {
            "settingValueTemplateId": "96ced765-4f68-441a-b9ad-b683cfdfa28f",
            "useTemplateDefault": false
          },
          "children": [],
          "value": "com.apple.managedclient.preferences_enforcementlevel_2"
        },
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "94f6f35c-4cee-4a61-930a-491b698c790a"
        }
      }
    },
    {
      "id": "13",
      "settingInstance": {
        "settingDefinitionId": "com.apple.managedclient.preferences_enforcementlevel_tamperprotection",
        "auditRuleInformation": null,
        "choiceSettingValue": {
          "settingValueTemplateReference": {
            "settingValueTemplateId": "6e25fd09-16f1-42fd-9ffe-954ee1c0b904",
            "useTemplateDefault": false
          },
          "children": [],
          "value": "com.apple.managedclient.preferences_enforcementlevel_tamperprotection_2"
        },
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "3c4efab3-cf91-4540-b86d-54507c90bb4b"
        }
      }
    },
    {
      "id": "14",
      "settingInstance": {
        "settingDefinitionId": "com.apple.managedclient.preferences_consumerexperience",
        "auditRuleInformation": null,
        "choiceSettingValue": {
          "settingValueTemplateReference": {
            "settingValueTemplateId": "95f4ea0a-5907-4008-931b-652105f937a0",
            "useTemplateDefault": false
          },
          "children": [],
          "value": "com.apple.managedclient.preferences_consumerexperience_1"
        },
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "1cb52ec2-c861-4c4a-9184-e4cc13eba6ad"
        }
      }
    },
    {
      "id": "15",
      "settingInstance": {
        "settingDefinitionId": "com.apple.managedclient.preferences_hidestatusmenuicon",
        "auditRuleInformation": null,
        "choiceSettingValue": {
          "settingValueTemplateReference": {
            "settingValueTemplateId": "fd30f322-4968-4479-8510-ad308ca8abe3",
            "useTemplateDefault": false
          },
          "children": [],
          "value": "com.apple.managedclient.preferences_hidestatusmenuicon_true"
        },
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "1b9f3e2b-46e8-4346-935d-dd0bd8ad2443"
        }
      }
    },
    {
      "id": "16",
      "settingInstance": {
        "settingDefinitionId": "com.apple.managedclient.preferences_userinitiatedfeedback",
        "auditRuleInformation": null,
        "choiceSettingValue": {
          "settingValueTemplateReference": {
            "settingValueTemplateId": "41df6cea-c66a-44a6-b37b-c73c811a898c",
            "useTemplateDefault": false
          },
          "children": [],
          "value": "com.apple.managedclient.preferences_userinitiatedfeedback_0"
        },
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "4423d695-27c2-4266-b253-bff098657834"
        }
      }
    }
  ],
  "platforms": "macOS",
  "technologies": "mdm,microsoftSense",
  "templateReference": {
    "templateFamily": "endpointSecurityAntivirus",
    "templateDisplayVersion": "Version 1",
    "templateDisplayName": "Microsoft Defender Antivirus",
    "templateId": "2d345ec2-c817-49e5-9156-3ed416dc972a_1"
  }
}
